workloads/vllm/uvm/results-100-5-512/logs-1/20251208_020129_lmcache_client.log
Command: uv run vllm bench serve --model Qwen/Qwen3-30B-A3B-FP8 --dataset-name sharegpt --num-prompts 100 --dataset-path /home/yunwei37/workspace/gpu/schedcp/workloads/vllm/datasets/ShareGPT_V3_unfiltered_cleaned_split.json --seed 42 --request-rate 5
Timestamp: 2025-12-08T02:09:32.291677
============================================================
STDOUT:
INFO 12-08 02:08:04 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x72126d82a520>, seed=42, num_prompts=100, dataset_name='sharegpt', no_stream=False, dataset_path='/home/yunwei37/workspace/gpu/schedcp/workloads/vllm/datasets/ShareGPT_V3_unfiltered_cleaned_split.json', no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='Qwen/Qwen3-30B-A3B-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=5.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
Initial test run completed. Starting main benchmark run...
Traffic request rate: 5.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Request rate configured (RPS):           5.00      
Benchmark duration (s):                  81.71     
Total input tokens:                      21566     
Total generated tokens:                  25066     
Request throughput (req/s):              1.22      
Output token throughput (tok/s):         306.77    
Peak output token throughput (tok/s):    651.00    
Peak concurrent requests:                71.00     
Total Token throughput (tok/s):          570.71    
---------------Time to First Token----------------
Mean TTFT (ms):                          270.84    
Median TTFT (ms):                        245.84    
P99 TTFT (ms):                           566.49    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          109.52    
Median TPOT (ms):                        110.01    
P99 TPOT (ms):                           145.74    
---------------Inter-token Latency----------------
Mean ITL (ms):                           96.85     
Median ITL (ms):                         97.02     
P99 ITL (ms):                            281.33    
==================================================

============================================================
STDERR:

 |          | 00:00 elapsed, ? remaining
 |          | 00:00 elapsed, 00:02 remaining
 |          | 00:02 elapsed, 247:37:50 remaining

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [00:02<04:39,  2.83s/it]
  2%|▏         | 2/100 [00:06<05:06,  3.12s/it]
  3%|▎         | 3/100 [00:06<03:00,  1.86s/it]
  4%|▍         | 4/100 [00:07<02:18,  1.44s/it]
  5%|▌         | 5/100 [00:07<01:49,  1.15s/it]
  6%|▌         | 6/100 [00:08<01:33,  1.00it/s]
  7%|▋         | 7/100 [00:08<01:05,  1.41it/s]
  9%|▉         | 9/100 [00:08<00:37,  2.42it/s]
 10%|█         | 10/100 [00:09<00:31,  2.87it/s]
 12%|█▏        | 12/100 [00:09<00:19,  4.49it/s]
 14%|█▍        | 14/100 [00:09<00:18,  4.55it/s]
 16%|█▌        | 16/100 [00:10<00:22,  3.70it/s]
 17%|█▋        | 17/100 [00:11<00:28,  2.89it/s]
 18%|█▊        | 18/100 [00:11<00:39,  2.09it/s]
 20%|██        | 20/100 [00:13<00:39,  2.03it/s]
 21%|██        | 21/100 [00:13<00:36,  2.16it/s]
 22%|██▏       | 22/100 [00:14<00:39,  1.97it/s]
 23%|██▎       | 23/100 [00:16<01:25,  1.10s/it]
 24%|██▍       | 24/100 [00:16<01:03,  1.19it/s]
 26%|██▌       | 26/100 [00:17<00:38,  1.92it/s]
 27%|██▋       | 27/100 [00:18<00:48,  1.51it/s]
 28%|██▊       | 28/100 [00:18<00:45,  1.59it/s]
 29%|██▉       | 29/100 [00:19<00:36,  1.93it/s]
 30%|███       | 30/100 [00:19<00:28,  2.45it/s]
 31%|███       | 31/100 [00:19<00:30,  2.25it/s]
 32%|███▏      | 32/100 [00:19<00:27,  2.51it/s]
 33%|███▎      | 33/100 [00:20<00:37,  1.80it/s]
 34%|███▍      | 34/100 [00:21<00:31,  2.06it/s]
 35%|███▌      | 35/100 [00:21<00:30,  2.14it/s]
 37%|███▋      | 37/100 [00:21<00:18,  3.34it/s]
 39%|███▉      | 39/100 [00:22<00:19,  3.14it/s]
 41%|████      | 41/100 [00:23<00:26,  2.26it/s]
 42%|████▏     | 42/100 [00:23<00:21,  2.68it/s]
 43%|████▎     | 43/100 [00:25<00:33,  1.71it/s]
 45%|████▌     | 45/100 [00:25<00:21,  2.54it/s]
 46%|████▌     | 46/100 [00:25<00:18,  2.85it/s]
 47%|████▋     | 47/100 [00:25<00:16,  3.19it/s]
 48%|████▊     | 48/100 [00:27<00:27,  1.86it/s]
 49%|████▉     | 49/100 [00:28<00:45,  1.13it/s]
 50%|█████     | 50/100 [00:30<00:50,  1.01s/it]
 51%|█████     | 51/100 [00:30<00:36,  1.33it/s]
 52%|█████▏    | 52/100 [00:30<00:32,  1.47it/s]
 53%|█████▎    | 53/100 [00:31<00:28,  1.66it/s]
 54%|█████▍    | 54/100 [00:33<00:52,  1.13s/it]
 55%|█████▌    | 55/100 [00:35<00:53,  1.19s/it]
 56%|█████▌    | 56/100 [00:36<00:56,  1.28s/it]
 57%|█████▋    | 57/100 [00:37<00:48,  1.13s/it]
 58%|█████▊    | 58/100 [00:38<00:45,  1.09s/it]
 59%|█████▉    | 59/100 [00:38<00:39,  1.03it/s]
 60%|██████    | 60/100 [00:39<00:30,  1.31it/s]
 61%|██████    | 61/100 [00:39<00:23,  1.69it/s]
 62%|██████▏   | 62/100 [00:40<00:28,  1.36it/s]
 63%|██████▎   | 63/100 [00:41<00:27,  1.34it/s]
 64%|██████▍   | 64/100 [00:42<00:27,  1.29it/s]
 65%|██████▌   | 65/100 [00:42<00:26,  1.31it/s]
 66%|██████▌   | 66/100 [00:43<00:21,  1.61it/s]
 67%|██████▋   | 67/100 [00:43<00:19,  1.66it/s]
 68%|██████▊   | 68/100 [00:44<00:18,  1.78it/s]
 69%|██████▉   | 69/100 [00:45<00:20,  1.49it/s]
 70%|███████   | 70/100 [00:46<00:24,  1.20it/s]
 71%|███████   | 71/100 [00:46<00:18,  1.56it/s]
 72%|███████▏  | 72/100 [00:46<00:15,  1.80it/s]
 73%|███████▎  | 73/100 [00:47<00:13,  1.93it/s]
 74%|███████▍  | 74/100 [00:47<00:14,  1.84it/s]
 75%|███████▌  | 75/100 [00:48<00:13,  1.87it/s]
 76%|███████▌  | 76/100 [00:49<00:16,  1.43it/s]
 77%|███████▋  | 77/100 [00:53<00:40,  1.77s/it]
 79%|███████▉  | 79/100 [00:54<00:25,  1.23s/it]
 80%|████████  | 80/100 [00:55<00:19,  1.02it/s]
 81%|████████  | 81/100 [00:57<00:24,  1.27s/it]
 82%|████████▏ | 82/100 [00:58<00:23,  1.32s/it]
 83%|████████▎ | 83/100 [00:58<00:16,  1.01it/s]
 84%|████████▍ | 84/100 [01:00<00:17,  1.10s/it]
 85%|████████▌ | 85/100 [01:02<00:22,  1.52s/it]
 86%|████████▌ | 86/100 [01:02<00:15,  1.11s/it]
 87%|████████▋ | 87/100 [01:03<00:11,  1.13it/s]
 88%|████████▊ | 88/100 [01:04<00:13,  1.10s/it]
 89%|████████▉ | 89/100 [01:05<00:09,  1.20it/s]
 90%|█████████ | 90/100 [01:05<00:08,  1.22it/s]
 91%|█████████ | 91/100 [01:08<00:12,  1.40s/it]
 92%|█████████▏| 92/100 [01:10<00:12,  1.51s/it]
 93%|█████████▎| 93/100 [01:10<00:08,  1.20s/it]
 94%|█████████▍| 94/100 [01:11<00:06,  1.02s/it]
 95%|█████████▌| 95/100 [01:12<00:05,  1.05s/it]
 96%|█████████▌| 96/100 [01:14<00:04,  1.24s/it]
 97%|█████████▋| 97/100 [01:14<00:02,  1.08it/s]
 99%|█████████▉| 99/100 [01:16<00:00,  1.14it/s]
100%|██████████| 100/100 [01:21<00:00,  2.05s/it]
100%|██████████| 100/100 [01:21<00:00,  1.22it/s]